
    // const [categories, setCategories] = useState({
    //     "الکترونیک": {
    //       "موبایل و تبلت": ["گوشی موبایل", "تبلت", "لوازم جانبی موبایل و تبلت"],
    //       "کالای دیجیتال": ["لپ تاپ", "دوربین", "تلویزیون", "کامپیوتر و تجهیزات جانبی", "بازی‌های رایانه‌ای", "محصولات مرتبط با چاپ", "محصولات مرتبط با شبکه"],
    //       "لوازم خانگی": ["لوازم برقی خانگی", "آشپزخانه", "تهویه مطبوع", "تلویزیون و سینمای خانگی", "لوازم تحریر و اداری", "ساعت و ساعت دیواری", "لوازم خودرو"],
    //       "فرهنگ و هنر": ["کتاب", "موسیقی", "فیلم و سریال", "نرم افزار و بازی", "کتاب صوتی", "پادکست", "اسباب بازی و هنر"],
    //       "پوشاک و اکسسوری": ["پوشاک مردانه", "پوشاک زنانه", "پوشاک بچگانه", "کفش و کیف", "لوازم آرایشی و بهداشتی", "عطر و ادکلن", "جواهرات و ساعت", "عینک"],
    //       "ورزش و سفر": ["ورزش و تناسب اندام", "کوهنوردی و شکار", "کمپینگ و شکار", "شنا و دوچرخه‌سواری", "اسب‌سواری و تجهیزات"]
    //     },
    //     "خانه": {
    //       "موبایل و تبلت": ["گوشی موبایل", "تبلت", "لوازم جانبی موبایل و تبلت"],
    //       "کالای دیجیتال": ["لپ تاپ", "دوربین", "تلویزیون", "کامپیوتر و تجهیزات جانبی", "بازی‌های رایانه‌ای", "محصولات مرتبط با چاپ", "محصولات مرتبط با شبکه"],
    //       "لوازم خانگی": ["لوازم برقی خانگی", "آشپزخانه", "تهویه مطبوع", "تلویزیون و سینمای خانگی", "لوازم تحریر و اداری", "ساعت و ساعت دیواری", "لوازم خودرو"],
    //       "فرهنگ و هنر": ["کتاب", "موسیقی", "فیلم و سریال", "نرم افزار و بازی", "کتاب صوتی", "پادکست", "اسباب بازی و هنر"],
    //       "پوشاک و اکسسوری": ["پوشاک مردانه", "پوشاک زنانه", "پوشاک بچگانه", "کفش و کیف", "لوازم آرایشی و بهداشتی", "عطر و ادکلن", "جواهرات و ساعت", "عینک"],
    //       "ورزش و سفر": ["ورزش و تناسب اندام", "کوهنوردی و شکار", "کمپینگ و شکار", "شنا و دوچرخه‌سواری", "اسب‌سواری و تجهیزات"]
    //     }
    //   });

